all_news = [
	{
		'id':1,
		'title':'1-e занятие прошло интенсивно и долго',
		'text':'все презнакомились и наглазелись, почти все пришли с огрызками',
		'date':'2016-03-11'
	},
	{
		'id':2,
		'title':'2-е занятие было странным',
		'text':'нам дали задание и возможность поковыряться с кодом',
		'date':'2016-03-18'
	},
	{
		'id':3,
		'title':'3-е занятие было eеще более странным',
		'text':'нам не дали задание и возможность поковыряться с кодом, но пытались извлечь из нас что-то, что мы слабо представляем',
		'date':'2016-03-25'
	}
	]


